STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_adc.c
  * @author  MCD Application Team
  * @brief   This file provides the advanced LPBAM layer for ADC peripheral.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                 ############### How to use this driver ###############
  ======================================================================================================================
    [..]
      It is strongly recommended to read carefully the GettingStarted.html document before starting developing an LPBAM
      application.

    *** Driver description ***
    ==========================
    [..]
      This driver is dedicated for ADC allowing to change configuration and operate in low power mode.
      This advanced LPBAM module counts 3 files :
          (+) stm32_adv_lpbam_adc.c
              (++) This file provides the ADC advanced files body.
          (+) stm32_adv_lpbam_adc.h
              (++) This file is the header file of stm32_adv_lpbam_adc.c. It provides advanced used types.
          (+) stm32_platform_lpbam_adc.h
              (++) This header file contains all defines to be used in applicative side.

    *** Driver features ***
    =======================
    [..]
      This driver provides the following list of features :
          (+) Configure the ADC peripheral for conversion.
          (+) Starts the ADC conversion.
          (+) Configure and starts the ADC conversion.
          (+) Configure and starts only the watchdog input signal monitoring without transfer to SRAM.

    *** Functional description ***
    ==============================
    [..]
      The ADC peripheral conversion is configured through a DMA channel thanks to a build DMA linked-list queue.
      The ADC peripheral conversion is started through a DMA channel thanks to a build DMA linked-list queue.
      The ADC peripheral conversion is configured and started through a DMA channel thanks to a build DMA linked-list
      queue.
      The ADC peripheral analog watchdog monitoring is configured and started without any data transfer to SRAM
      through a DMA channel thanks to a build DMA linked-list queue.

      The output of this driver is a queue to be executed by a DMA channel.

    *** Driver APIs description ***
    ===============================
    [..]
      Use ADV_LPBAM_ADC_Conversion_SetConfigQ() API to build a linked-list queue that setup the ADC configuration
      operation according to parameters in the LPBAM_ADC_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_ADC_Conversion_SetDataQ() API to build a linked-list queue that setup the ADC conversion
      starting operation according to parameters in the LPBAM_ADC_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_HALFWORD. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_HALFWORD.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_ADC_Conversion_SetFullQ() API to build a linked-list queue that setup the ADC configuration
      and conversion starting operation according to parameters in the LPBAM_ADC_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_HALFWORD. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_HALFWORD.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ() API to build a linked-list queue that setup the ADC analog watchdog
      configuration operation according to parameters in the LPBAM_ADC_AWDGFullAdvConf_t structure (without any data
      transfer to SRAM).

    [..]
      Configured parameters through ADV_LPBAM_ADC_Conversion_SetConfigQ are :
          (+) ScanConvMode          : Configure the sequencer of ADC groups regular.
                                      This parameter can be a value of @ref LPBAM_ADC_Sequence_Scan_Mode.
          (+) ContinuousConvMode    : Specify whether the conversion is performed in single or continuous mode.
                                      This parameter can be ENABLE or DISABLE.
          (+) DiscontinuousConvMode : Specify whether the conversions sequence of ADC group regular is performed in
                                      Complete-sequence/Discontinuous-sequence.
                                      This parameter can be ENABLE or DISABLE.
          (+) ExternalTrigConv      : Select the external event source used to trigger ADC conversion start.
                                      This parameter can be a value of @ref LPBAM_ADC_Trigger_Selection.
          (+) ExternalTrigConvEdge  : Select the external event edge used to trigger ADC  conversion start.
                                      This parameter can be a value of @ref LPBAM_ADC_Trigger_Polarity.
          (+) TriggerFrequencyMode  : Set ADC trigger frequency mode.
                                      This parameter can be a value of @ref LPBAM_ADC_Trigger_LowFrequency.
          (+) LowPowerAutoWait      : Select the dynamic low power Auto Delay.
                                      This parameter can be ENABLE or DISABLE.
          (+) DMAContinuousRequests : Specify whether the DMA requests are performed in one shot or in continuous
                                      mode.
                                      This parameter can be ENABLE or DISABLE.
          (+) AnalogWDGConfig       : Structure definition of ADC analog watchdog.
              (++) WatchdogNumber       : Select which ADC analog watchdog is monitoring the selected channel.
                                          This parameter can be a value of @ref LPBAM_ADC_AnalogWatchDog_Number.
              (++) WatchdogMode         : Configure the ADC analog watchdog mode.
                                          This parameter can be a value of @ref LPBAM_ADC_AnalogWatchDog_Mode.
              (++) Channel              : Select which ADC channel to monitor by analog watchdog.
                                          This parameter can be a value of @ref LPBAM_ADC_Channel_Selection.
              (++) ITMode               : Specify whether the analog watchdog is configured in interrupt or polling
                                          mode.
                                          This parameter can be ENABLE or DISABLE.
              (++) LowThreshold         : Specifies the ADC watchdog low threshold.
                                          This parameter can be a value from 0 to 0xFFF.
              (++) HighThreshold        : Specifies the ADC watchdog high threshold.
                                          This parameter can be a value from 0 to 0xFFF.

      Configured parameters through ADV_ADC_Conversion_SetDataQ() are :
          (+) pData : Specifies the address of data buffer
          (+) Size  : Specifies the size of data to be read.

    Configured parameters through ADV_LPBAM_ADC_Conversion_SetFullQ() are :
          (+) ScanConvMode          : Configure the sequencer of ADC groups regular.
                                      This parameter can be a value of @ref LPBAM_ADC_Sequence_Scan_Mode.
          (+) ContinuousConvMode    : Specify whether the conversion is performed in single or continuous mode.
                                      This parameter can be ENABLE or DISABLE.
          (+) DiscontinuousConvMode : Specify whether the conversions sequence of ADC group regular is performed in
                                      Complete-sequence/Discontinuous-sequence.
                                      This parameter can be ENABLE or DISABLE.
          (+) ExternalTrigConv      : Select the external event source used to trigger ADC conversion start.
                                      This parameter can be a value of @ref LPBAM_ADC_Trigger_Selection.
          (+) ExternalTrigConvEdge  : Select the external event edge used to trigger ADC  conversion start.
                                      This parameter can be a value of @ref LPBAM_ADC_Trigger_Polarity .
          (+) TriggerFrequencyMode  : Set ADC trigger frequency mode.
                                      This parameter can be a value of @ref LPBAM_ADC_Trigger_LowFrequency.
          (+) LowPowerAutoWait      : Select the dynamic low power Auto Delay.
                                      This parameter can be ENABLE or DISABLE.
          (+) DMAContinuousRequests : Specify whether the DMA requests are performed in one shot or in continuous
                                      mode.
                                      This parameter can be ENABLE or DISABLE.
          (+) AnalogWDGConfig       : Structure definition of ADC analog watchdog.
              (++) WatchdogNumber       : Select which ADC analog watchdog is monitoring the selected channel.
                                          This parameter can be a value of @ref LPBAM_ADC_AnalogWatchDog_Number.
              (++) WatchdogMode         : Configure the ADC analog watchdog mode.
                                          This parameter can be a value of @ref LPBAM_ADC_AnalogWatchDog_Mode.
              (++) Channel              : Select which ADC channel to monitor by analog watchdog.
                                          This parameter can be a value of @ref LPBAM_ADC_Channel_Selection.
              (++) ITMode               : Specify whether the analog watchdog is configured in interrupt or polling
                                          mode.
                                          This parameter can be ENABLE or DISABLE.
              (++) LowThreshold         : Specifies the ADC watchdog low threshold.
                                          This parameter can be a value from 0 to 0xFFF.
              (++) HighThreshold        : Specifies the ADC watchdog high threshold.
                                          This parameter can be a value from 0 to 0xFFF.
          (+) pData                 : Specifies the address of data buffer.
          (+) Size                  : Specifies DMA transfer number of ADC conversion data.

