STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
      Configured parameters through ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ() are :
          (+) WatchdogNumber : Select which ADC analog watchdog is monitoring the selected channel.
          (+) WatchdogMode   : Configure the ADC analog watchdog mode.
          (+) Channel        : Select which ADC channel to monitor by analog watchdog.
          (+) ITMode         : Specify whether the analog watchdog is configured in interrupt or polling mode.
          (+) LowThreshold   : Specifies the ADC watchdog low threshold.
          (+) HighThreshold  : Specifies the ADC watchdog high threshold.

      Configured parameters through ADV_LPBAM_ADC_ChannelConfig() are :
          (+) Channel : Specify the channel to configure into ADC regular group.
          (+) Rank    : Specify the rank in the regular group sequencer.

    [..]
      These APIs must be called when the ADC instance is well initialized.
          (+) Recommended ADC instance initialization sequence
              (++) Call HAL_ADC_Init() to initialize the ADC instance. (Mandatory).
                   (+++) ClockPrescaler           : ADC_CLOCK_ASYNC_DIV4.
                   (+++) Resolution               : ADC_RESOLUTION_12B.
                   (+++) ScanConvMode             : ADC_SCAN_DIRECTION_FORWARD.
                   (+++) EOCSelection             : ADC_EOC_SINGLE_CONV.
                   (+++) LowPowerAutoWait         : DISABLE.
                   (+++) ContinuousConvMode       : ENABLE.
                   (+++) DiscontinuousConvMode    : DISABLE.
                   (+++) ExternalTrigConv         : ADC4_EXTERNALTRIG_LPTIM1_CH1.
                   (+++) ExternalTrigConvEdge     : ADC_EXTERNALTRIGCONVEDGE_RISING.
                   (+++) ConversionDataManagement : ADC_CONVERSIONDATA_DMA_CIRCULAR.
                   (+++) DMAContinuousRequests    : ENABLE.
                   (+++) Overrun                  : ADC_OVR_DATA_OVERWRITTEN.
                   (+++) OversamplingMode         : DISABLE.
                   (+++) Oversampling             : Specify the Oversampling parameters.
                   (+++) SamplingTimeCommon1      : ADC4_SAMPLETIME_160CYCLES_5.
                   (+++) LowPowerAutoPowerOff     : ADC_LOW_POWER_AUTOFF_DPD.
              (++) Call HAL_ADCEx_Calibration_Start() to start the ADC instance calibration.
                   (+++) CalibrationMode : ADC_CALIB_OFFSET.
                   (+++) SingleDiff      : ADC_SINGLE_ENDED.
                                           No linearity calibration neither differential mode for ADC4.
              (++) Call HAL_ADC_ConfigChannel() to configure the channels to be used for ADC conversion. (Optional).
                   (+++) Channel      : ADC_CHANNEL_4.
                   (+++) Rank         : ADC4_REGULAR_RANK_1.
                   (+++) SamplingTime : ADC4_SAMPLINGTIME_COMMON_1.
              (++) Call HAL_ADC_AnalogWDGConfig() to configure the ADC analog watchdog settings. (Optional).
                   (+++) WatchdogNumber : ADC_ANALOGWATCHDOG_1.
                   (+++) WatchdogMode   : ADC_ANALOGWATCHDOG_ALL_REG.
                   (+++) ITMode         : ENABLE.
                   (+++) HighThreshold  : ADC_AWD_THRESHOLD_HIGH_VAL.
                   (+++) LowThreshold   : ADC_AWD_THRESHOLD_LOW_VAL.
              (++) Call __HAL_ADC_ENABLE_IT() to enable error interrupts. (Optional).
                   ADC error interrupts can be :
                   (+++) ADC_IT_OVR   : ADC overrun interrupt source.

    [..]
      When using ADV_LPBAM_ADC_Conversion_SetConfigQ(), ADV_LPBAM_ADC_Conversion_SetDataQ()
      and ADV_LPBAM_ADC_Conversion_SetFullQ() APIs, the following parameters must be configured
      carefully when initializing ADC peripheral as they are not configurable by LPBAM APIs :
          (+) ClockPrescaler       : This parameter can be a value of @ref ADC_HAL_EC_COMMON_CLOCK_SOURCE.
          (+) Resolution           : This parameter can be a value of @ref ADC_HAL_EC_RESOLUTION.
          (+) Overrun              : This parameter can be a value of @ref ADC_HAL_EC_REG_OVR_DATA_BEHAVIOR.
          (+) OversamplingMode     : This parameter can be set to ENABLE or DISABLE.
          (+) Oversampling         : This parameter can be set by filling the structure @ref ADC_OversamplingTypeDef.
          (+) SamplingTimeCommon1  : This parameter can be value of @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME.
          (+) LowPowerAutoPowerOff : This parameter can be value of @ref ADC_HAL_LowPower_DPD.
          (+) CalibrationMode      : This parameter should be @ref ADC_CALIB_OFFSET.
          (+) SingleDiff           : This parameter should be @ref ADC_SINGLE_ENDED.
                                     No linearity calibration neither differential mode for ADC4.

    [..]
      When using only ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ() API, the following parameters must be configured
      carefully when initializing ADC peripheral as they are not configurable by LPBAM API :
          (+) ClockPrescaler        : This parameter can be a value of @ref ADC_HAL_EC_COMMON_CLOCK_SOURCE.
          (+) Resolution            : This parameter can be a value of @ref ADC_HAL_EC_RESOLUTION.
          (+) ScanConvMode          : This parameter can be a value of @ref ADC_Scan_mode.
          (+) LowPowerAutoWait      : This parameter can be set to ENABLE or DISABLE.
          (+) ContinuousConvMode    : This parameter can be set to ENABLE or DISABLE.
          (+) DiscontinuousConvMode : This parameter can be set to ENABLE or DISABLE.
          (+) ExternalTrigConv      : This parameter can be a value of @ref ADC_regular_external_trigger_source.
          (+) ExternalTrigConvEdge  : This parameter can be a value of @ref ADC_regular_external_trigger_edge.
          (+) DMAContinuousRequests : This parameter can be set to ENABLE or DISABLE.
          (+) Overrun               : This parameter can be a value of @ref ADC_HAL_EC_REG_OVR_DATA_BEHAVIOR.
          (+) OversamplingMode      : This parameter can be set to ENABLE or DISABLE.
          (+) Oversampling          : This parameter can be set by filling the structure @ref ADC_OversamplingTypeDef.
          (+) SamplingTimeCommon1   : This parameter can be value of @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME.
          (+) LowPowerAutoPowerOff  : This parameter can be value of @ref ADC_HAL_LowPower_DPD.
          (+) CalibrationMode       : This parameter should be @ref ADC_CALIB_OFFSET.
          (+) SingleDiff              This parameter should be @ref ADC_SINGLE_ENDED.
                                      No linearity calibration neither differential mode for ADC4.
          (+) Channel               : This parameter can be a value of @ref ADC_HAL_EC_CHANNEL.
          (+) Rank                  : This parameter can be a value of @ref ADC_HAL_EC_REG_SEQ_RANKS.
          (+) SamplingTime          : This parameter can be a value of @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME.

