STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
    [..]
      The channels configuration for the ADC peripheral is optional as it could be reconfigured by LPBAM APIs except for
      analog watchdog API (where channels configuration for the ADC peripheral is mandatory).

    [..]
      The channels configuration for the ADC peripheral depends from the sequencer mode :
          (+) In case of sequencer configured to fully configurable, ADV_LPBAM_ADC_ChannelConfig() API could be called
              for 8 time maximum (number of possible sequencer ranks).
          (+) In case of sequencer configured to not fully configurable, ADV_LPBAM_ADC_ChannelConfig() API could
              be called for 23 time maximum (number of possible channels).

    [..]
      The analog watchdog configuration for the ADC peripheral is optional as it could be reconfigured by LPBAM APIs.

    [..]
      When the WatchdogMode is LPBAM_ADC_ANALOGWATCHDOG_SINGLE_REG (only for AWD2 and AWD3), one or a combination of
      @ref LPBAM_ADC_Channel_Selection can be selected.

    *** Driver user sequence ***
    ============================
    [..]
      Generic user sequence is :
          (+) Initialize the ADC (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_ADC_EnableDMARequests() to enable ADC DMA requests. (Mandatory)
          (+) There are three possibilities to call advanced API:
              (++) Conversion with full API :
                   (+++) Repeat calling ADV_LPBAM_ADC_Conversion_SetFullQ() until complete LPBAM scenario. (Mandatory)
                   (+++) Repeat calling ADV_LPBAM_ADC_ChannelConfig() after each ADV_LPBAM_ADC_Conversion_SetFullQ()
                         call to add ADC channels for conversion. (Mandatory)
              (++) Conversion with configuration and data APIs :
                   (+++) Call ADV_LPBAM_ADC_Conversion_SetConfigQ() only one time. (Mandatory)
                   (+++) Repeat calling ADV_LPBAM_ADC_ChannelConfig() after each ADV_LPBAM_ADC_Conversion_SetConfigQ()
                         call to add ADC channels for conversion. (Mandatory)
                   (+++) Repeat calling ADV_LPBAM_ADC_Conversion_SetDataQ() until complete LPBAM scenario. (Mandatory)
          (+) Call ADV_LPBAM_Q_SetCircularMode() to circularize your linked-list queue for infinite scenarios
              cases. (Optional)
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call ADV_LPBAM_Q_SetTriggerConfig() to add hardware trigger condition for executing
              ADV_LPBAM_OPAMP_Start_SetFullQ() output queue. (Optional)
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call HAL_DMAEx_List_Init() to initialize the DMA in linked-list mode. (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the built queue to the DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() or HAL_DMAEx_List_Start_IT() to start DMA linked list. (Mandatory)

    [..]
      When the ADC configuration matches with application needs, it's strongly recommended to use
      ADV_LPBAM_ADC_Conversion_SetDataQ() API instead of ADV_LPBAM_ADC_Conversion_SetFullQ() for memory optimization
      purpose.

    [..]
      Use ADV_LPBAM_ADC_Conversion_SetFullQ() when ADC reconfiguration is needed instead of calling
      ADV_LPBAM_ADC_Conversion_SetConfigQ() then ADV_LPBAM_ADC_Conversion_SetDataQ() for memory optimization purpose.

    [..]
      Use ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ() when only ADC analog watchdog reconfiguration is needed instead of
      calling ADV_LPBAM_ADC_Conversion_SetConfigQ() or ADV_LPBAM_ADC_Conversion_SetFullQ() for memory optimization
      purpose if the ADC configuration matches with application needs (channels).

    *** Constraints ***
    ===================
    [..]
      It's useless to call ADV_LPBAM_ADC_Conversion_SetConfigQ() consecutively as the first configuration will be
      overwritten.

    [..]
      It's useless to call ADV_LPBAM_ADC_Conversion_SetConfigQ() before ADV_LPBAM_ADC_Conversion_SetFullQ() as
      ADV_LPBAM_ADC_Conversion_SetFullQ() API contains configuration process.

    [..]
      It's mandatory to call ADV_LPBAM_ADC_ChannelConfig() after ADV_LPBAM_ADC_Start_SetFullQ()
      or ADV_LPBAM_ADC_Conversion_SetConfigQ() to configure ADC channels to be used.

    [..]
      It's strongly recommended to call ADV_LPBAM_ADC_ChannelConfig() staring from LPBAM_ADC_REGULAR_RANK_1
      incrementally to LPBAM_ADC_REGULAR_RANK_8 in case of "ScanConvMode" is set to LPBAM_ADC_SCAN_ENABLE.

    [..]
      It's strongly not recommended to call ADV_LPBAM_ADC_Start_SetFullQ() with the same instance by more than one
      linked-list queue. When the ADC nodes will be executed simultaneously unexpected behavior will appear.

    [..]
      It's strongly not recommended to execute the same linked-list queue that contains ADC configuration and data
      nodes by two different DMA channels as unexpected behavior can appear.

    [..]
      When current ADC configuration matches with application needs, it's strongly recommended to use
      ADV_LPBAM_ADC_Conversion_SetDataQ() for memory optimization purpose.

    [..]
      When using ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ() with LPBAM_ADC_ANALOGWATCHDOG_NONE value, it's worth to mention
      that registers will be reset to default values and the Analog Watchdog will be disabled.

    [..]
      When using ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ(), it's worth to mention that previous settings will be
      overwritten (for all analog watchdogs). Therefore, modifying one AWD settings will erase other AWDs settings.

    *** Driver status description ***
    =================================
    [..]
      This driver detects and reports any detected issue.
          (+) returned values are :
              (++) LPBAM_OK when no error is detected.
              (++) LPBAM_ERROR when error is detected.
              (++) LPBAM_INVALID_ID when an invalid node ID is detected. This error value is specific for LPBAM basic
                   layer.

    @endverbatim
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_lpbam.h"

