STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build analog watchdog 2 threshold node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 3 threshold node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.pSrcVarReg                       = &pDescriptor->pReg[reg_idx];

  /* Set ADC AWDG configuration */
  config_node.Config.UpdateAnalogWDG                    = LPBAM_ADC_ANALOGWATCHDOG_3;
  config_node.Config.AnalogWDGConfig[2U].WatchdogNumber = LPBAM_ADC_ANALOGWATCHDOG_3;
  config_node.Config.AnalogWDGConfig[2U].LowThreshold   = pConvConfig->AnalogWDGConfig[2U].LowThreshold;
  config_node.Config.AnalogWDGConfig[2U].HighThreshold  = pConvConfig->AnalogWDGConfig[2U].HighThreshold;
  config_node.Config.AnalogWDGConfig[2U].WatchdogMode   = pConvConfig->AnalogWDGConfig[2U].WatchdogMode;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build analog watchdog 3 threshold node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC configuration node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID                  = (uint32_t)LPBAM_ADC_CONFIG_ID;
  config_node.NodeDesc.pSrcVarReg                       = &pDescriptor->pReg[reg_idx];

  /* Set ADC trigger configuration */
  config_node.Config.ExternalTrigConv                   = pConvConfig->ExternalTrigConv;
  config_node.Config.ExternalTrigConvEdge               = pConvConfig->ExternalTrigConvEdge;
  config_node.Config.LowPowerAutoWait                   = pConvConfig->LowPowerAutoWait;

  /* Set ADC channel configuration */
  config_node.Config.ScanConvMode                       = pConvConfig->ScanConvMode;
  config_node.Config.ContinuousConvMode                 = pConvConfig->ContinuousConvMode;
  config_node.Config.DiscontinuousConvMode              = pConvConfig->DiscontinuousConvMode;

  /* Set ADC analog watchdog configuration */
  config_node.Config.UpdateAnalogWDG                    = LPBAM_ADC_ANALOGWATCHDOG_DEFAULT;

  /* Set ADC DMA circular or one shot mode */
  config_node.Config.DMAContinuousRequests              = pConvConfig->DMAContinuousRequests;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC channel selection node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_ADC_CHANNELSELECTION_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build channel selection node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC clock prescaler node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_ADC_CLKPRESCALER_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build prescaler node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC trigger low frequency node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID    = (uint32_t)LPBAM_ADC_TRIG_LOWFREQUENCY_ID;
  config_node.NodeDesc.pSrcVarReg         = &pDescriptor->pReg[reg_idx];

  /* Set ADC configuration */
  config_node.Config.TriggerFrequencyMode = pConvConfig->TriggerFrequencyMode;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build trigger low frequency node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 2 monitor node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID                  = (uint32_t)LPBAM_ADC_AWDG_MONITOR_ID;
  config_node.NodeDesc.pSrcVarReg                       = &pDescriptor->pReg[reg_idx];

  /* Set ADC AWDG configuration */
  config_node.Config.UpdateAnalogWDG                    = LPBAM_ADC_ANALOGWATCHDOG_2;
  config_node.Config.AnalogWDGConfig[1U].WatchdogNumber = LPBAM_ADC_ANALOGWATCHDOG_2;
  config_node.Config.AnalogWDGConfig[1U].WatchdogMode   = pConvConfig->AnalogWDGConfig[1U].WatchdogMode;
  config_node.Config.AnalogWDGConfig[1U].Channel        = pConvConfig->AnalogWDGConfig[1U].Channel;

