STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build analog watchdog 2 monitor node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 3 monitor node ########
   */

  /* Set ADC instance */
  config_node.pInstance                                 = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID                  = (uint32_t)LPBAM_ADC_AWDG_MONITOR_ID;
  config_node.NodeDesc.pSrcVarReg                       = &pDescriptor->pReg[reg_idx];

  /* Set ADC AWDG configuration */
  config_node.Config.UpdateAnalogWDG                    = LPBAM_ADC_ANALOGWATCHDOG_3;
  config_node.Config.AnalogWDGConfig[2U].WatchdogNumber = LPBAM_ADC_ANALOGWATCHDOG_3;
  config_node.Config.AnalogWDGConfig[2U].WatchdogMode   = pConvConfig->AnalogWDGConfig[2U].WatchdogMode;
  config_node.Config.AnalogWDGConfig[2U].Channel        = pConvConfig->AnalogWDGConfig[2U].Channel;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build analog watchdog 3 monitor node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC wake up interrupt node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID          = (uint32_t)LPBAM_ADC_WAKEUP_IT_ID;
  config_node.NodeDesc.pSrcVarReg               = &pDescriptor->pReg[reg_idx];

  /* Set ADC wakeup interrupt */
  config_node.Config.AnalogWDGConfig[0U].ITMode = pConvConfig->AnalogWDGConfig[0U].ITMode;
  config_node.Config.AnalogWDGConfig[1U].ITMode = pConvConfig->AnalogWDGConfig[1U].ITMode;
  config_node.Config.AnalogWDGConfig[2U].ITMode = pConvConfig->AnalogWDGConfig[2U].ITMode;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build wake up interrupt node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the ADC conversion data nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_ADC_DataAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a ADC_TypeDef structure that selects ADC instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pConvData    : [IN]  Pointer to a LPBAM_ADC_DataAdvConf_t structure that contains conversion data
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_ADC_ConvDataDesc_t structure that contains conversion data
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_ADC_Conversion_SetDataQ(ADC_TypeDef              *const pInstance,
                                                 LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                                 LPBAM_ADC_DataAdvConf_t  const *const pConvData,
                                                 LPBAM_ADC_ConvDataDesc_t *const pDescriptor,
                                                 DMA_QListTypeDef         *const pQueue)
{
  LPBAM_ADC_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dmaNodeConfig;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /*
   *               ######## ADC start node ########
   */

  /* Set ADC instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_ADC_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Set ADC configuration */
  config_node.Config.State               = ENABLE;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build start node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  node_idx++;


  /*
   *               ######## ADC data node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_ADC_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)&pConvData->pData[0U];

  /* Set Data Size */
  config_node.Config.Size              = pConvData->Size;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

