STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
  return LPBAM_OK;
}

/**
  * @brief  Build the ADC conversion full nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_ADC_FullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a ADC_TypeDef structure that selects ADC instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pConvFull    : [IN]  Pointer to a LPBAM_ADC_FullAdvConf_t structure that contains conversion full
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_ADC_ConvFullDesc_t structure that contains conversion full
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_ADC_Conversion_SetFullQ(ADC_TypeDef              *const pInstance,
                                                 LPBAM_DMAListInfo_t      const *const pDMAListInfo,
                                                 LPBAM_ADC_FullAdvConf_t  const *const pConvFull,
                                                 LPBAM_ADC_ConvFullDesc_t *const pDescriptor,
                                                 DMA_QListTypeDef         *const pQueue)
{
  LPBAM_ADC_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dmaNodeConfig;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /*
   *               ######## ADC stop node ########
   */

  /* Set ADC instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_ADC_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Set ADC configuration */
  config_node.Config.State               = DISABLE;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build stop node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## Clear ADC flag node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_ADC_CLEARFLAG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 1 threshold node ########
   */


  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID                  = (uint32_t)LPBAM_ADC_AWDG_THRESHOLD_ID;
  config_node.NodeDesc.pSrcVarReg                       = &pDescriptor->pReg[reg_idx];

  /* Set ADC configuration */
  config_node.Config.UpdateAnalogWDG                    = LPBAM_ADC_ANALOGWATCHDOG_1;
  config_node.Config.AnalogWDGConfig[0U].WatchdogNumber = LPBAM_ADC_ANALOGWATCHDOG_1;
  config_node.Config.AnalogWDGConfig[0U].WatchdogMode   = pConvFull->AnalogWDGConfig[0U].WatchdogMode;
  config_node.Config.AnalogWDGConfig[0U].Channel        = pConvFull->AnalogWDGConfig[0U].Channel;
  config_node.Config.AnalogWDGConfig[0U].LowThreshold   = pConvFull->AnalogWDGConfig[0U].LowThreshold;
  config_node.Config.AnalogWDGConfig[0U].HighThreshold  = pConvFull->AnalogWDGConfig[0U].HighThreshold;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build analog watchdog 1 threshold node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 2 threshold node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.pSrcVarReg                       = &pDescriptor->pReg[reg_idx];

  /* Set ADC AWDG configuration */
  config_node.Config.UpdateAnalogWDG                    = LPBAM_ADC_ANALOGWATCHDOG_2;
  config_node.Config.AnalogWDGConfig[1U].WatchdogNumber = LPBAM_ADC_ANALOGWATCHDOG_2;
  config_node.Config.AnalogWDGConfig[1U].LowThreshold   = pConvFull->AnalogWDGConfig[1U].LowThreshold;
  config_node.Config.AnalogWDGConfig[1U].HighThreshold  = pConvFull->AnalogWDGConfig[1U].HighThreshold;
  config_node.Config.AnalogWDGConfig[1U].WatchdogMode   = pConvFull->AnalogWDGConfig[1U].WatchdogMode;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build analog watchdog 2 threshold node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


