STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 2 monitor node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID           = (uint32_t)LPBAM_ADC_AWDG_MONITOR_ID;
  config_node.NodeDesc.pSrcVarReg                = &pDescriptor->pReg[reg_idx];

  /* Set ADC analog watchdog configuration */
  config_node.Config.UpdateAnalogWDG             = LPBAM_ADC_ANALOGWATCHDOG_2;
  config_node.Config.AnalogWDGConfig[1U].Channel = pAWDGFull->AnalogWDGConfig[1U].Channel;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC analog watchdog 3 monitor node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.pSrcVarReg                = &pDescriptor->pReg[reg_idx];

  /* Set ADC analog watchdog configuration */
  config_node.Config.UpdateAnalogWDG             = LPBAM_ADC_ANALOGWATCHDOG_3;
  config_node.Config.AnalogWDGConfig[2U].Channel = pAWDGFull->AnalogWDGConfig[2U].Channel;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC interrupt state node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID          = (uint32_t)LPBAM_ADC_WAKEUP_IT_ID;
  config_node.NodeDesc.pSrcVarReg               = &pDescriptor->pReg[reg_idx];

  /* Set ADC Wakeup interrupt */
  config_node.Config.AnalogWDGConfig[0U].ITMode = pAWDGFull->AnalogWDGConfig[0U].ITMode;
  config_node.Config.AnalogWDGConfig[1U].ITMode = pAWDGFull->AnalogWDGConfig[1U].ITMode;
  config_node.Config.AnalogWDGConfig[2U].ITMode = pAWDGFull->AnalogWDGConfig[2U].ITMode;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build interrupt state node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## ADC start node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_ADC_STATE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set ADC configuration */
  config_node.Config.State             = ENABLE;

  /* Fill node configuration */
  if (LPBAM_ADC_FillNodeConfig(&config_node, &dmaNodeConfig) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build start node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to ADC queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Configure the ADC channel in LPBAM_ADC_FullAdvConf_t or LPBAM_ADC_ConfigAdvConf_t according to configured
  *         parameters in LPBAM_ADC_ChannelAdvConf_t.
  * @param  pChannel     : [IN]  Pointer to a LPBAM_ADC_ChannelAdvConf_t structure that contains conversion full
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Void pointer to a LPBAM_ADC_FullAdvConf_t or LPBAM_ADC_ConfigAdvConf_t structure
  *                              that contains conversion descriptor information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_ADC_ChannelConfig(LPBAM_ADC_ChannelAdvConf_t *const pChannel,
                                           void                       *pDescriptor)
{
  /* Get descriptor base address */
  uint32_t config_adc_node_addr = ((uint32_t)pDescriptor);
  uint32_t channelsel_node_addr = ((uint32_t)pDescriptor);
  uint32_t intchannel_node_addr = ((uint32_t)pDescriptor);

  /* Calculate nodes addresses */
  config_adc_node_addr += (5U * sizeof(DMA_NodeTypeDef));
  channelsel_node_addr += (6U * sizeof(DMA_NodeTypeDef));
  intchannel_node_addr += (7U * sizeof(DMA_NodeTypeDef));

  /* Calculate nodes DMA source address offsets */
  uint32_t preg_config_adc_addr = ((DMA_NodeTypeDef *)config_adc_node_addr)->LinkRegisters[NODE_CSAR_DEFAULT_OFFSET];
  uint32_t preg_channelsel_addr = ((DMA_NodeTypeDef *)channelsel_node_addr)->LinkRegisters[NODE_CSAR_DEFAULT_OFFSET];
  uint32_t preg_intchannel_addr = ((DMA_NodeTypeDef *)intchannel_node_addr)->LinkRegisters[NODE_CSAR_DEFAULT_OFFSET];

  uint32_t channel_sel;
  uint32_t dummy = 0UL;

  /* Check ADC channel */
  switch (pChannel->ChannelConfig.Channel)
  {
    case LPBAM_ADC_CHANNEL_VREFINT:
    {
      /* Set VREFEN bit in CCR register */
      *(uint32_t *)(preg_intchannel_addr) |= (1UL << LPBAM_ADC_VREFEN_POS);

      break;
    }

