STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_adc.c
    case LPBAM_ADC_CHANNEL_TEMPSENSOR:
    {
      /* Set VSENSEEN bit in CCR register */
      *(uint32_t *)(preg_intchannel_addr) |= (1UL << LPBAM_ADC_VSENSEEN_POS);

      break;
    }

    case LPBAM_ADC_CHANNEL_VBAT:
    {
      /* Set VBATEN bit in CCR register */
      *(uint32_t *)(preg_intchannel_addr) |= (1UL << LPBAM_ADC_VBATEN_POS);

      break;
    }

    case LPBAM_ADC_CHANNEL_0:
    {
      /* Clear VREFEN bit in CCR register */
      *(uint32_t *)(preg_intchannel_addr) &= ~(1UL << LPBAM_ADC_VREFEN_POS);

      break;
    }

    case LPBAM_ADC_CHANNEL_13:
    {
      /* Clear VSENSEEN bit in CCR register */
      *(uint32_t *)(preg_intchannel_addr) &= ~(1UL << LPBAM_ADC_VSENSEEN_POS);

      break;
    }

    case LPBAM_ADC_CHANNEL_14:
    {
      /* Clear VBATEN bit in CCR register */
      *(uint32_t *)(preg_intchannel_addr) &= ~(1UL << LPBAM_ADC_VBATEN_POS);

      break;
    }

    default:
    {
      break;
    }
  }

  channel_sel = pChannel->ChannelConfig.Channel & (~CHANNEL_ID_INTERNAL_CH);

  /* Check scan mode */
  if ((*(uint32_t *)preg_config_adc_addr & LPBAM_ADC_CHSELRMOD) == 0U)
  {
    /* Update register with channel */
    *(uint32_t *)(preg_channelsel_addr) |= channel_sel;
  }
  else
  {
    /* Force default value to next RANK to stop sequence */
    dummy |= (LPBAM_ADC_CHANNEL_RANK_DEFAULT << ((pChannel->ChannelConfig.Rank + 4U) & 0x1FU));

    /* Update register with channel in the appropriate RANK */
    MODIFY_REG((dummy), (LPBAM_ADC_CHANNEL_RANK_DEFAULT << ((pChannel->ChannelConfig.Rank) & 0x1FU)),
               (POSITION_VAL(channel_sel) << ((pChannel->ChannelConfig.Rank) & 0x1FU)));

    /* Set register  */
    *(uint32_t *)(preg_channelsel_addr) |= dummy ;
  }

  return LPBAM_OK;
}

/**
  * @brief  Enable the ADC DMA requests.
  * @param  pInstance    : [IN]  Pointer to a ADC_TypeDef structure that selects ADC instance.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_ADC_EnableDMARequests(ADC_TypeDef *const pInstance)
{
  /* Enable ADC DMA requests */
  pInstance->CFGR1 |= LPBAM_ADC_DMAEN;

  /* Enable ADC instance */
  pInstance->CR |= LPBAM_ADC_ADEN;

  return LPBAM_OK;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LPBAM_ADC_MODULE_ENABLED */
